Revit 2027 API
RebarBendData.TerminationOrientation0 Property
 Identifies he orientation of the termination (e.g. hook, crank) at the start. The default value is RebarTerminationOrientation::Left.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarTerminationOrientation TerminationOrientation0 { get; set; }
Public Property TerminationOrientation0 As RebarTerminationOrientation
	Get
	Set
public:
property RebarTerminationOrientation TerminationOrientation0 {
	RebarTerminationOrientation get ();
	void set (RebarTerminationOrientation value);
}
member TerminationOrientation0 : RebarTerminationOrientation with get, set
Property Value
RebarTerminationOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace